nxp-mcuxpresso/mcux-soc-svd/LPC54016/LPC54016.xml
        <register>
          <name>STIM16_READ</name>
          <description>Stimulus Port Register 16 (for reading)</description>
          <alternateGroup>STIM16_READ_STIM16_WRITE</alternateGroup>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM16_WRITE</name>
          <description>Stimulus Port Register 16 (for writing)</description>
          <alternateGroup>STIM16_READ_STIM16_WRITE</alternateGroup>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM17_READ</name>
          <description>Stimulus Port Register 17 (for reading)</description>
          <alternateGroup>STIM17_READ_STIM17_WRITE</alternateGroup>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM17_WRITE</name>
          <description>Stimulus Port Register 17 (for writing)</description>
          <alternateGroup>STIM17_READ_STIM17_WRITE</alternateGroup>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM18_READ</name>
          <description>Stimulus Port Register 18 (for reading)</description>
          <alternateGroup>STIM18_READ_STIM18_WRITE</alternateGroup>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM18_WRITE</name>
          <description>Stimulus Port Register 18 (for writing)</description>
          <alternateGroup>STIM18_READ_STIM18_WRITE</alternateGroup>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM19_READ</name>
          <description>Stimulus Port Register 19 (for reading)</description>
          <alternateGroup>STIM19_READ_STIM19_WRITE</alternateGroup>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM19_WRITE</name>
          <description>Stimulus Port Register 19 (for writing)</description>
          <alternateGroup>STIM19_READ_STIM19_WRITE</alternateGroup>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM20_READ</name>
          <description>Stimulus Port Register 20 (for reading)</description>
          <alternateGroup>STIM20_READ_STIM20_WRITE</alternateGroup>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM20_WRITE</name>
          <description>Stimulus Port Register 20 (for writing)</description>
          <alternateGroup>STIM20_READ_STIM20_WRITE</alternateGroup>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM21_READ</name>
          <description>Stimulus Port Register 21 (for reading)</description>
          <alternateGroup>STIM21_READ_STIM21_WRITE</alternateGroup>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM21_WRITE</name>
          <description>Stimulus Port Register 21 (for writing)</description>
          <alternateGroup>STIM21_READ_STIM21_WRITE</alternateGroup>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM22_READ</name>
          <description>Stimulus Port Register 22 (for reading)</description>
          <alternateGroup>STIM22_READ_STIM22_WRITE</alternateGroup>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM22_WRITE</name>
          <description>Stimulus Port Register 22 (for writing)</description>
          <alternateGroup>STIM22_READ_STIM22_WRITE</alternateGroup>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM23_READ</name>
          <description>Stimulus Port Register 23 (for reading)</description>
          <alternateGroup>STIM23_READ_STIM23_WRITE</alternateGroup>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM23_WRITE</name>
          <description>Stimulus Port Register 23 (for writing)</description>
          <alternateGroup>STIM23_READ_STIM23_WRITE</alternateGroup>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM24_READ</name>
          <description>Stimulus Port Register 24 (for reading)</description>
          <alternateGroup>STIM24_READ_STIM24_WRITE</alternateGroup>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM24_WRITE</name>
          <description>Stimulus Port Register 24 (for writing)</description>
          <alternateGroup>STIM24_READ_STIM24_WRITE</alternateGroup>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM25_READ</name>
          <description>Stimulus Port Register 25 (for reading)</description>
          <alternateGroup>STIM25_READ_STIM25_WRITE</alternateGroup>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM25_WRITE</name>
          <description>Stimulus Port Register 25 (for writing)</description>
          <alternateGroup>STIM25_READ_STIM25_WRITE</alternateGroup>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM26_READ</name>
          <description>Stimulus Port Register 26 (for reading)</description>
          <alternateGroup>STIM26_READ_STIM26_WRITE</alternateGroup>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM26_WRITE</name>
          <description>Stimulus Port Register 26 (for writing)</description>
          <alternateGroup>STIM26_READ_STIM26_WRITE</alternateGroup>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM27_READ</name>
          <description>Stimulus Port Register 27 (for reading)</description>
          <alternateGroup>STIM27_READ_STIM27_WRITE</alternateGroup>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM27_WRITE</name>
          <description>Stimulus Port Register 27 (for writing)</description>
          <alternateGroup>STIM27_READ_STIM27_WRITE</alternateGroup>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM28_READ</name>
          <description>Stimulus Port Register 28 (for reading)</description>
          <alternateGroup>STIM28_READ_STIM28_WRITE</alternateGroup>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM28_WRITE</name>
          <description>Stimulus Port Register 28 (for writing)</description>
          <alternateGroup>STIM28_READ_STIM28_WRITE</alternateGroup>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM29_READ</name>
          <description>Stimulus Port Register 29 (for reading)</description>
          <alternateGroup>STIM29_READ_STIM29_WRITE</alternateGroup>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM29_WRITE</name>
          <description>Stimulus Port Register 29 (for writing)</description>
          <alternateGroup>STIM29_READ_STIM29_WRITE</alternateGroup>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM30_READ</name>
          <description>Stimulus Port Register 30 (for reading)</description>
          <alternateGroup>STIM30_READ_STIM30_WRITE</alternateGroup>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM30_WRITE</name>
          <description>Stimulus Port Register 30 (for writing)</description>
          <alternateGroup>STIM30_READ_STIM30_WRITE</alternateGroup>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM31_READ</name>
          <description>Stimulus Port Register 31 (for reading)</description>
          <alternateGroup>STIM31_READ_STIM31_WRITE</alternateGroup>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM31_WRITE</name>
          <description>Stimulus Port Register 31 (for writing)</description>
          <alternateGroup>STIM31_READ_STIM31_WRITE</alternateGroup>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
